{"https://linqhelp.mcoutput.com/linq-nutrition/Content/pos.titank12.com/POS%20Home%20Screen.htm": "POS Home Screen\nSkip To Main Content\nAccount\nSettings\nLogout\nplaceholder\nAccount\nSettings\nLogout\nFilter:\nAll Files\nSubmit Search\nFilter:\nAll Files\nSubmit Search\nPOS Home Screen\npos.titank12.com\nTITAN Logo - click to enter full screen mode\nNotice the District Name and Cafeteria Name\nNotice the Terminal Number, Date, Time, and Cashier Name\nCloud Icon - notice the status of the cloud iconGreen Check - connected to cloudGray Dash - not connected to cloudOrange Exclamation mark - device is not receiving a full download of the student databaseRed Number - number of transactions saved in browser for communication when connection returns\n< - click to log out\nServing Sessions - select a listed serving session to be redirected to the default serving mode screen (PIN, Photo, or Buffered). Note: The serving session must be available and published at the cafeteria to be displayed here.\nCurbside Meals - click to be redirected to the PIN Mode Screen for curbside serving. Note: this is only displayed if enabled.\nRecall Transaction - click to be redirected to the recall transactions screen.\nChange Date - click to change the date\nSelect the date for which to enter meals (Default: Today).\nPast Month - click to scroll to previous months\nNext Month - click to scroll to future months\nOkay - click to change the date\nX - click to return to the previous screen without saving\nCredit Account - click to be redirected to the credit account screen.\nTraining Mode - click to put the POS in Training Mode. The screen will get a training model border and title, and no data will be saved to the cloud.\nSettings - click to open the settings menu\nDownload Remote Tools - downloads the Screenconnect client executable file and allows access at any time by TITAN Staff. Note: If screenconnect has not been used on the device before, the customer will need to open/run the executable to be able to connect. Depending on how the district has setup their access for users, IT may need to execute the file under a login that has admin rights.\nOpen Support Session - If the Screenconnect client has been successfully installed, this option will open a one-time screenconnect session in a new tab of the browser, ready for the unique number to connect.\nExport Transactions - Exports transactions from the device into a JSON file that is downloaded and placed in the Download folder on the device. Note: Use this option if there is no way to get a device back online and it has transactions stored in the TITAN cloud icon. The JSON file will need to be imported into TITAN to bring transactions into the system.\nUnhook Terminal - Releases the POS license from the terminal without forgetting the POS ID. Note: Use this option if the user wants to use one license on multiple devices.\nClear Student Database - Clears the students from the cache on the device. Note: Use this option when cashier is not seeing a student at the POS but in the portal the student is there, and appears to be correctly enrolled and available. This may also be used when a device will no longer be used for serving to clear any student information from that device.\nOkay - click to return to previous screen\nKeyboard - use the touchscreen to type in lieu of a physical keyboard. Note: click the bottom left corner of the ABC/.@123 button to access the Developer Menu\nClose Register - click to be redirected to the Close Register screen\nÂ© 2024 | EMS LINQ, LLC\nwww.linq.com\nLINQ Nutrition (TITAN) Help, updated 10/2024\nNutrition (TITAN)", "https://linqhelp.mcoutput.com/linq-nutrition/Content/pos.titank12.com/PIN%20Mode.htm": "PIN Mode\nSkip To Main Content\nAccount\nSettings\nLogout\nplaceholder\nAccount\nSettings\nLogout\nFilter:\nAll Files\nSubmit Search\nFilter:\nAll Files\nSubmit Search\nPIN Mode\npos.titank12.com\nTITAN Logo - click to enter full screen mode\nNotice the District Name and Cafeteria Name\nNotice the Terminal Number, Date, Time, and Cashier Name\nCloud Icon - notice the status of the cloud iconGreen Check - connected to cloudGray Dash - not connected to cloudRed Number - number of transactions saved in browser for communication when connection returns\n< - click to return to the previous screen\nNotice the selected Serving Session.Date (not pictured, changed date only) - notice the date if different than today\nEnter Next Id - enter the next identifier or POS ID keypad, keyboard, touchscreen, or barcode scanner to be redirected to serving screen if eat and repeat is not enabled\nno id student - click to serve a No ID student (paid eligibility)\nno id adult - click to serve a No ID non-student\nKeyboard - use the on screen keyboard to type in lieu of a physical keyboard\nNotice the Previous Transaction information including the person's photo, name, ID or POS ID, Balance, Assigned or Enrolled Building, Grade (students only), and alert message if applicable. Click the Receipt icon to return to the serving screen to re-process or void the transaction.\nTotal Meals - click to view total meals served\nMode - click to change the serving mode\nPin - click to select pin mode. Enter identifier or PIN via keypad, keyboard, or barcode scanner to serve\nPhoto - click to select photo mode. Click the person's photo to serve.\nBuffered - click to select buffered mode. Enter identifier or PIN via left/right keypad or barcode scanner. Students will line up on either side of screen. Click person's photo to serve.\nSearch - click to be redirected to the search screen\nEat and Repeat - click to toggle Eat and Repeat status. Note: This is only visible if Eat and Repeat is enabled.Green - Eat and Repeat is ON (person is served default item without being redirected to serving screen)Orange - Eat and Repeat is PAUSED for next personRed - Eat and Repeat is OFF\nÂ© 2024 | EMS LINQ, LLC\nwww.linq.com\nLINQ Nutrition (TITAN) Help, updated 10/2024\nNutrition (TITAN)", "https://linqhelp.mcoutput.com/linq-nutrition/Content/Point%20of%20Service/Point%20of%20Service%20Guides.htm?tocpath=Point%20of%20Service%7C_____0": "Point of Service Guides\nSkip To Main Content\nAccount\nSettings\nLogout\nplaceholder\nAccount\nSettings\nLogout\nFilter:\nAll Files\nSubmit Search\nFilter:\nAll Files\nSubmit Search\nPoint of Service Guides\nIn this section, you will find:\nInstalling the POS\nPOS Operation\nDeveloper Menu\nÂ© 2024 | EMS LINQ, LLC\nwww.linq.com\nLINQ Nutrition (TITAN) Help, updated 10/2024\nNutrition (TITAN)", "https://linqhelp.mcoutput.com/linq-nutrition/Content/pos.titank12.com/Credit%20Account.htm": "Credit Account\nSkip To Main Content\nAccount\nSettings\nLogout\nplaceholder\nAccount\nSettings\nLogout\nFilter:\nAll Files\nSubmit Search\nFilter:\nAll Files\nSubmit Search\nCredit Account\npos.titank12.com\nâ\u0080\u008bâ\u0080\u008b\nTITAN Logo - click to enter full screen mode\nNotice the District Name and Cafeteria Nameâ\u0080\u008b\nNotice the Terminal Number, Date, Time, and Cashier Nameâ\u0080\u008b\nCloud Icon - notice the status of the cloud iconGreen Check - connected to cloudGray Dash - not connected to cloudRed Number - number of transactions saved in browser for communication when connection returns\n< - click to return to the home screenâ\u0080\u008b\nNotice the indication of Credit Account modeDate (not pictured, changed date only) - notice the date if different than today\nNotice the selected person's photo, name, ID or POS ID, Balance, Assigned or Enrolled Building, Grade (students only), and alert message if applicable.\nNotice the Current Balance.\nSelect the payment item:Cash - click to select cash as the payment methodCheck - click to select check as the payment method\nAmount - enter the amount paid\nKeyboard - use the on screen keyboard to type in lieu of a physical keyboard\nQuick Numbers - use the quick numbers to enter a common amount quickly\nBalance After Total - notice the balance after total (Balance After Total = Current Balance + Amount)\nDeposit - click to apply payment to account\nâ\u0080\u008b\nÂ© 2024 | EMS LINQ, LLC\nwww.linq.com\nLINQ Nutrition (TITAN) Help, updated 10/2024\nNutrition (TITAN)", "https://linqhelp.mcoutput.com/linq-nutrition/Content/pos.titank12.com/POS%20Login%20Screen.htm": "POS Login Screen\nSkip To Main Content\nAccount\nSettings\nLogout\nplaceholder\nAccount\nSettings\nLogout\nFilter:\nAll Files\nSubmit Search\nFilter:\nAll Files\nSubmit Search\nPOS Login Screen\npos.titank12.com\nTITAN Logo - click to enter full screen mode\nNotice the District Name and Cafeteria Name\nNotice the Terminal Number, Date, and Time\nCloud Icon - notice the status of the cloud iconGreen Check - connected to cloudGray Dash - not connected to cloudRed Number - number of transactions saved in browser for communication when connection returns\n< - click to return to the previous screen (non-functional on this screen)\nPrevious Users - notice the last 5 users to log in. Click to populate the Username field.\nDistrict Logo - notice the district logo\nKeyboard - use the touchscreen to type in lieu of a physical keyboard. Note: click the bottom left corner of the ABC/.@123 button to access the Developer Menu\nUsername, Password - enter the username and password. Click login to be redirected to the POS Home Screen.\nÂ© 2024 | EMS LINQ, LLC\nwww.linq.com\nLINQ Nutrition (TITAN) Help, updated 10/2024\nNutrition (TITAN)", "https://linqhelp.mcoutput.com/linq-nutrition/Content/pos.titank12.com/Serving%20Screen.htm": "Serving Screen\nSkip To Main Content\nAccount\nSettings\nLogout\nplaceholder\nAccount\nSettings\nLogout\nFilter:\nAll Files\nSubmit Search\nFilter:\nAll Files\nSubmit Search\nServing Screen\npos.titank12.com\nTITAN Logo - click to enter full screen mode\nNotice the District Name and Cafeteria Name\nNotice the Terminal Number, Date, Time, and Cashier Name\nCloud Icon - notice the status of the cloud iconGreen Check - connected to cloudGray Dash - not connected to cloudRed Number - number of transactions saved in browser for communication when connection returns\n< - non-functional on this screen\nNotice the selected Serving Session.Date (not pictured, changed date only) - notice the date if different than today\nNotice the selected person's photo, name, ID or POS ID, Balance, Assigned or Enrolled Building, Grade (students only), and alert message if applicable.\nNotice the Alert Message (blue exclamation point) and/or Allergies (red cross) symbols. Click the blue symbol to view alert message, dietary restrictions, religious restrictions. Click the red symbol to view allergies.\nNotice the selected sales items, quantities, and prices. Click the quantity to to change. Click the Trash Can icon to remove the item. Notice the Total dollar value. Click the arrows to scroll through the list of selected items.Note: The price of a reimbursable item will show with X.XX in place of actual price if Display Reimbursable Meal Price is not selected.\nDevice Layout - tap items on the device layout to select for purchase. Tap an item multiple items to add to the quantity.\nPages - tap to select a different page. Click < > to scroll through pages.\nCredit Card - click to pay for the transaction with a credit card if enabled and return to the PIN, Photo, or Buffered screen.\nEarned - click to process the transaction at no cost if enabled and return to the PIN, Photo, or Buffered screen.\nAccount or Charge - click to pay for the transaction with the person's account funds ( Account = sufficient funds; Charge = insufficient funds) and return to the PIN, Photo, or Buffered screen.\nOver The Charge Limit - if the person's account would go beyond the charge limit and the cashier has override rights, an \"Over the Charge Limit\" message appears.\na. Cancel - click to return to the serving screen and not allow the person to exceed the charge limit.\nb. Override - click to allow the person to exceed the charge limit and complete the transaction.\nExact Change - click to process the transaction with exact change given and return to the PIN, Photo, or Buffered screen.\nCancel - click to return to the previous screen without completing the transactionVoid (not pictured, previous transaction only) - click to void the transaction\nTotal - click to be redirected to the Total Screen to process a check, external, school account, or non-exact cash payment.\nAlert Message\nAn alert message will appear prior to entering the serving screen if the student has limitations and alerts are enabled.\nNotice the selected person's photo, name, ID or POS ID, Balance, Assigned or Enrolled Building, and Grade (students only).\nNotice the allergy message, dietary restrictions message, religious restrictions message, and pos alert message. Notice the low balance and charge messages if enabled. Notice that if the person is over the charge limit, you will be sent to the serve screen if enabled.\nCancel - click to return to the previous screen\nOkay - click to proceed to the serving screen (non-eat and repeat) or complete the transaction (eat and repeat)\nÂ© 2024 | EMS LINQ, LLC\nwww.linq.com\nLINQ Nutrition (TITAN) Help, updated 10/2024\nNutrition (TITAN)", "https://linqhelp.mcoutput.com/linq-nutrition/Content/pos.titank12.com/Unlicensed%20POS%20Screen.htm": "Unlicensed POS Screen\nSkip To Main Content\nAccount\nSettings\nLogout\nplaceholder\nAccount\nSettings\nLogout\nFilter:\nAll Files\nSubmit Search\nFilter:\nAll Files\nSubmit Search\nUnlicensed POS Screen\npos.titank12.com\nThis is also known as \"licensing\" and sometimes called \"installing the POS.\"\nTITAN Logo - click to enter full screen mode\nNotice the Date and Time\nCloud Icon - notice the status of the cloud iconGreen Check - connected to cloudGray Dash - not connected to cloudRed Number - number of transactions saved in browser for communication when connection returns\n< - non-functional on this screen\nPOS Identifier - enter the POS Identifier\nOkay - click to be redirected to the login screen\nKeyboard - use the touchscreen to type in lieu of a physical keyboard. Note: click the bottom left corner of the ABC/.@123 button to access the Developer Menu\nÂ© 2024 | EMS LINQ, LLC\nwww.linq.com\nLINQ Nutrition (TITAN) Help, updated 10/2024\nNutrition (TITAN)", "https://linqhelp.mcoutput.com/linq-nutrition/Content/pos.titank12.com/Close%20Register.htm": "Close Register\nSkip To Main Content\nAccount\nSettings\nLogout\nplaceholder\nAccount\nSettings\nLogout\nFilter:\nAll Files\nSubmit Search\nFilter:\nAll Files\nSubmit Search\nClose Register\nThe Close Register screen functions to enter the cash count from the point of service. Each terminal should complete only one cash count per day or one cash count per day per cashier depending on configuration.\nâ\u0080\u008bâ\u0080\u008b\nTITAN Logo - click to enter full screen mode\nNotice the District Name and Cafeteria Nameâ\u0080\u008b\nNotice the Terminal Number, Date, Time, and Cashier Nameâ\u0080\u008b\nCloud Icon - notice the status of the cloud iconGreen Check - connected to cloudGray Dash - not connected to cloudRed Number - number of transactions saved in browser for communication when connection returns\n< - click to return to the previous screen\nFor each denomination enter the count of bills/coins or the total dollar value. (Bills: $100, $50, $20, $10, $5, $2, $1; Coins: Dollar, Half Dollar, Quarter, Dime, Nickel, Penny)\nKeyboard - use the touchscreen to type in lieu of a physical keyboard.\nCheck - notice the total check value accepted\nTotal Cash, Total Checks, Drawer Total - notice the total value of checks accepted, cash as entered, and the grand total\nView Expected Cash - click to view expected cash (security right dependent)\nSave - click to save the cash count and log outâ\u0080\u008b\nâ\u0080\u008b\nÂ© 2024 | EMS LINQ, LLC\nwww.linq.com\nLINQ Nutrition (TITAN) Help, updated 10/2024\nNutrition (TITAN)", "https://linqhelp.mcoutput.com/linq-nutrition/Content/pos.titank12.com/POS%20Operation.htm": "POS Operation\nSkip To Main Content\nAccount\nSettings\nLogout\nplaceholder\nAccount\nSettings\nLogout\nFilter:\nAll Files\nSubmit Search\nFilter:\nAll Files\nSubmit Search\nPOS Operation\nIn this section, you will find:\nPOS Login Screen\nPOS Home Screen\nPIN Mode\nPhoto Mode\nBuffered Mode\nClose Register\nRecall Transactions\nCredit Account\nPOS Search Screen\nServing Screen\nTotal Screen\nCurbside Meals\nÂ© 2024 | EMS LINQ, LLC\nwww.linq.com\nLINQ Nutrition (TITAN) Help, updated 10/2024\nNutrition (TITAN)", "https://linqhelp.mcoutput.com/linq-nutrition/Content/pos.titank12.com/Photo%20Mode.htm": "Photo Mode\nSkip To Main Content\nAccount\nSettings\nLogout\nplaceholder\nAccount\nSettings\nLogout\nFilter:\nAll Files\nSubmit Search\nFilter:\nAll Files\nSubmit Search\nPhoto Mode\npos.titank12.com\nUpon initial entry into Photo mode, you will be asked to select filters. See Step 16 for details.\nTITAN Logo - click to enter full screen mode\nNotice the District Name and Cafeteria Name\nNotice the Terminal Number, Date, Time, and Cashier Name\nCloud Icon - notice the status of the cloud iconGreen Check - connected to cloudGray Dash - not connected to cloudRed Number - number of transactions saved in browser for communication when connection returns\n< - click to return to the previous screen\nNotice the selected Serving Session.Date (not pictured, changed date only) - notice the date if different than today\nNotice the selected Filter (Step 16).\nNotice the person's photo, name, and ID or POS ID. Click to select that person.\nEnter Next Id - enter the next identifier or POS ID keypad, keyboard, touchscreen, or barcode scanner to be redirected to serving screen if eat and repeat is not enabled\nClear - click to clear the Enter Next Id field\nno id student - click to serve a No ID student (paid eligibility)\nno id adult - click to serve a No ID non-student\n< > - click to scroll through pages of photos\nNotice the Previous Transaction information including the person's photo, name, ID or POS ID, Balance, Assigned or Enrolled Building, Grade (students only), and alert message if applicable. Click the Receipt icon to return to the serving screen to re-process or void the transaction.\nTotal Meals - click to view total meals served\nFilter - click to change the photo filters\nChoose filter type: Everyone, Grade, Homeroom, or Tags.\nSelect the chosen filter option: Grades, Homerooms, or Tags\n< > - click to scroll through pages of filter options\nChoose between:All Persons - view all persons within selected filterLast 7 Days - view persons within selected filter who have had a transaction at this building in the last 7 days\nChoose sort order: Sort By Last Name or Sort By First Name\nOkay - click to apply filters\nMode - click to change the serving mode\nPin - click to select pin mode. Enter identifier or PIN via keypad, keyboard, or barcode scanner to serve\nPhoto - click to select photo mode. Click the person's photo to serve.\nBuffered - click to select buffered mode. Enter identifier or PIN via left/right keypad or barcode scanner. Students will line up on either side of screen. Click person's photo to serve.\nSearch - click to be redirected to the search screen\nEat and Repeat - click to toggle Eat and Repeat status. Note: This is only visible if Eat and Repeat is enabled.Green - Eat and Repeat is ON (person is served default item without being redirected to serving screen)Orange - Eat and Repeat is PAUSED for next personRed - Eat and Repeat is OFF\nÂ© 2024 | EMS LINQ, LLC\nwww.linq.com\nLINQ Nutrition (TITAN) Help, updated 10/2024\nNutrition (TITAN)", "https://linqhelp.mcoutput.com/linq-nutrition/Content/pos.titank12.com/POS%20Search%20Screen.htm": "POS Search Screen\nSkip To Main Content\nAccount\nSettings\nLogout\nplaceholder\nAccount\nSettings\nLogout\nFilter:\nAll Files\nSubmit Search\nFilter:\nAll Files\nSubmit Search\nPOS Search Screen\npos.titank12.com\nTITAN Logo - click to enter full screen mode\nNotice the dDistrict Name and Cafeteria Name\nNotice the Terminal Number, Date, Time, and Cashier Name\nCloud Icon - notice the status of the cloud iconGreen Check - connected to cloudGray Dash - not connected to cloudRed Number - number of transactions saved in browser for communication when connection returns\n< - click to return to the previous screen\nNotice the person's photo, name, and ID or POS ID. Click to select that person.\nSearch - search by ID, POS ID, or name\nInclude All Buildings - check to include results from all buildings (Default: Terminal building, Step 2)\n< > - click to scroll through pages of results\nKeyboard - use the touchscreen to type in lieu of a physical keyboard. Note: click the bottom left corner of the ABC/.@123 button to access the Developer Menu\nÂ© 2024 | EMS LINQ, LLC\nwww.linq.com\nLINQ Nutrition (TITAN) Help, updated 10/2024\nNutrition (TITAN)", "https://linqhelp.mcoutput.com/linq-nutrition/Content/pos.titank12.com/Recall%20Transactions.htm": "Recall Transactions\nSkip To Main Content\nAccount\nSettings\nLogout\nplaceholder\nAccount\nSettings\nLogout\nFilter:\nAll Files\nSubmit Search\nFilter:\nAll Files\nSubmit Search\nRecall Transactions\npos.titank12.com\nTITAN Logo - click to enter full screen mode\nNotice the District Name and Cafeteria Name\nNotice the Terminal Number, Date, Time, and Cashier Name\nCloud Icon - notice the status of the cloud iconGreen Check - connected to cloudGray Dash - not connected to cloudRed Number - number of transactions saved in browser for communication when connection returns\n< - click to return to the home screen\nNotice the person's photo, name, and ID or POS ID. Click to view transaction details.\nNotice the selected person's photo, name, ID, POS ID, Balance, Assigned or Enrolled Building, and Grade (students only).\nNotice the transaction details including the serving date, transaction date and time, sales item(s) and quantity, and total amount. Check to select the transaction.\n< > - click to view other transactions by the same student\nClose - click to return to the previous screen without voiding\nVoid - click to void the selected transaction. Select a Void Reason if required. Click Okay.\nSearch - search by ID, POS ID, or name\nSort by Person - click to sort transactions alphabetically (default)\nSort by Transaction Time - click to sort transactions in reverse chronological order\n< > - click to scroll through pages of results\nKeyboard - use the touchscreen to type in lieu of a physical keyboard. Note: click the bottom left corner of the ABC/.@123 button to access the Developer Menu\nÂ© 2024 | EMS LINQ, LLC\nwww.linq.com\nLINQ Nutrition (TITAN) Help, updated 10/2024\nNutrition (TITAN)", "https://linqhelp.mcoutput.com/linq-nutrition/Content/pos.titank12.com/Curbside%20Meals.htm": "Curbside Meals\nSkip To Main Content\nAccount\nSettings\nLogout\nplaceholder\nAccount\nSettings\nLogout\nFilter:\nAll Files\nSubmit Search\nFilter:\nAll Files\nSubmit Search\nCurbside Meals\nPOS Home Screen > Curbside Meals\nCurbside Meals Service - notice that curbside meal service is the current serving session\nNotice the Photo, Name, ID, Balance, Assigned or Enrolled Building, Grade (not pictured, students only), Alert Message, Allergies (not pictured), and Restrictions (not pictured). Note: The Balance is color-coded based on negative (red), low (orange), or above the balance warning (black).\nTotal - notice transation total\nDate - click date(s) and Serving Sessions(s) of to which to apply curbside items\nX - notice non-academic days\nCredit Card - click to document a credit card payment if enabled\nEarned - click to process the transaction at no cost if enabled\nAccount (sufficient funds) or Charge (insufficient funds) - click to apply the transaction to the person's account\nExact Change - click to process a cash transaction with EXACT CHANGE\nCancel - click to return to the previous screen without completing the transaction\nTotal - click to be redirected to the Total screen to process a check, external, school acount, or non-exact cash payment\nÂ© 2024 | EMS LINQ, LLC\nwww.linq.com\nLINQ Nutrition (TITAN) Help, updated 10/2024\nNutrition (TITAN)", "https://linqhelp.mcoutput.com/linq-nutrition/Content/pos.titank12.com/Buffered%20Mode.htm": "Buffered Mode\nSkip To Main Content\nAccount\nSettings\nLogout\nplaceholder\nAccount\nSettings\nLogout\nFilter:\nAll Files\nSubmit Search\nFilter:\nAll Files\nSubmit Search\nBuffered Mode\npos.titank12.com\nTITAN Logo - click to enter full screen mode\nNotice the District Name and Cafeteria Name\nNotice the Terminal Number, Date, Time, and Cashier Name\nCloud Icon - notice the status of the cloud iconGreen Check - connected to cloudGray Dash - not connected to cloudRed Number - number of transactions saved in browser for communication when connection returns\n< - click to return to the previous screen\nNotice the selected Serving Session.\nDate (not pictured, changed date only) - notice the date if different than today\nLeft - Notice the entered persons from the left keypad including the person's photo, name, ID or POS ID, and alert message if applicable. Click to select that person. Click the Trash Can icon to remove the card from the screen.\nNotice the entered persons from the right keypad. See Step 7 for details.\nNotice the Previous Transaction information including the person's photo, name, ID or POS ID, Balance, Assigned or Enrolled Building, Grade (students only), and alert message if applicable. Click the Receipt icon to return to the serving screen to re-process or void the transaction.\nTotal Meals - click to view total meals served\nno id student - click to serve a No ID student (paid eligibility)\nno id adult - click to serve a No ID non-student\nMode - click to change the serving mode\nPin - click to select pin mode. Enter identifier or PIN via keypad, keyboard, or barcode scanner to serve\nPhoto - click to select photo mode. Click the person's photo to serve.\nBuffered - click to select buffered mode. Enter identifier or PIN via left/right keypad or barcode scanner. Students will line up on either side of screen. Click person's photo to serve.\nSearch - click to be redirected to the search screen\nEat and Repeat - click to toggle Eat and Repeat status. Note: This is only visible if Eat and Repeat is enabled.Green - Eat and Repeat is ON (person is served default item without being redirected to serving screen)Orange - Eat and Repeat is PAUSED for next personRed - Eat and Repeat is OFF\nÂ© 2024 | EMS LINQ, LLC\nwww.linq.com\nLINQ Nutrition (TITAN) Help, updated 10/2024\nNutrition (TITAN)", "https://linqhelp.mcoutput.com/linq-nutrition/Content/pos.titank12.com/Developer%20Menu.htm": "Developer Menu\nSkip To Main Content\nAccount\nSettings\nLogout\nplaceholder\nAccount\nSettings\nLogout\nFilter:\nAll Files\nSubmit Search\nFilter:\nAll Files\nSubmit Search\nDeveloper Menu\npos.titank12.com\nNotice the Displayed Text.\nDiagnostics Export - click to download the diagnostics json file\nTerminal Sync ON OFF - click to toggle terminal sync status\nAutomatic Online - toggle between:Automatic Online - system default (longer than 500 millisecond response time forces POS offline)Forced Online - system is forced to stay online (no offline functionality)Forced Offline - system is forced into offline mode\nClear Last Sync Date - click to clear the last sync date/time to force the system to update data elements (default is every 15 minutes)\nClear Local Data - click to wipe the entire local database and reset the terminal\nShow Session - click to change displayed text to Session (default)\nShow Log - click to change displayed text to Log\nShow Sync Log - click to change displayed text to Sync Log\nClear Log - click to clear log\nClear Sync Log - click to clear sync log\nClose - click to return to the previous screen\nÂ© 2024 | EMS LINQ, LLC\nwww.linq.com\nLINQ Nutrition (TITAN) Help, updated 10/2024\nNutrition (TITAN)", "https://linqhelp.mcoutput.com/linq-nutrition/Content/pos.titank12.com/POS%20Login%20Screen%20Unlicensed%20Device.htm": "POS Login Screen Unlicensed Device\nSkip To Main Content\nAccount\nSettings\nLogout\nplaceholder\nAccount\nSettings\nLogout\nFilter:\nAll Files\nSubmit Search\nFilter:\nAll Files\nSubmit Search\nPOS Login Screen Unlicensed Device\npos.titank12.com\nIMPORTANT: The POS license is stored in the browser's history; therefore, we recommend that only one computer user account is used per device. If each cashier has their own\nlogin to the computer itself, the POS will need to be re-licensed each time a new user logs in. TITAN will track all transaction activity to each cashier's TITAN account.\nTITAN Logo - click to enter full screen mode\nNotice the District Name\nNotice the Date, Time, and cashier name\nCloud Icon - notice the status of the cloud iconGreen Check - connected to cloudGray Dash - not connected to cloudRed Number - number of transactions saved in browser for communication when connection returns\n< - non-functional on this screen\nPlease Login - enter the Username and Password\nLogin - click to select the cafeteria and device\nSelect Cafeteria - choose cafeteria\nCancel - click to return to the previous screen\nSelect Terminal - select the device to be redirected to the POS home screen. Note: Only available devices will be displayed. If the needed device is not displayed, the license is in use. Clear the session to release the license.\nCancel - click to return to the previous screen\nKeyboard - use the touchscreen to type in lieu of a physical keyboard. Note: click the bottom left corner of the ABC/.@123 button to access the Developer Menu\nÂ© 2024 | EMS LINQ, LLC\nwww.linq.com\nLINQ Nutrition (TITAN) Help, updated 10/2024\nNutrition (TITAN)", "https://linqhelp.mcoutput.com/linq-nutrition/Content/pos.titank12.com/Installing%20the%20POS.htm": "Installing the POS\nSkip To Main Content\nAccount\nSettings\nLogout\nplaceholder\nAccount\nSettings\nLogout\nFilter:\nAll Files\nSubmit Search\nFilter:\nAll Files\nSubmit Search\nInstalling the POS\nIn this section, you will find:\nUnlicensed POS Screen\nPOS Login Screen Unlicensed Device\nÂ© 2024 | EMS LINQ, LLC\nwww.linq.com\nLINQ Nutrition (TITAN) Help, updated 10/2024\nNutrition (TITAN)", "https://linqhelp.mcoutput.com/linq-nutrition/Content/pos.titank12.com/Total%20Screen.htm": "Total Screen\nSkip To Main Content\nAccount\nSettings\nLogout\nplaceholder\nAccount\nSettings\nLogout\nFilter:\nAll Files\nSubmit Search\nFilter:\nAll Files\nSubmit Search\nTotal Screen\npos.titank12.com\nTITAN Logo - click to enter full screen mode\nNotice the District Name and Cafeteria Name\nNotice the Terminal Number, Date, Time, and Cashier Name\nCloud Icon - notice the status of the cloud iconGreen Check - connected to cloudGray Dash - not connected to cloudRed Number - number of transactions saved in browser for communication when connection returns\n< - click to return to the Serving Screen\nNotice the selected Serving Session.Date (not pictured, changed date only) - notice the date if different than today\nNotice the selected person's photo, name, ID or POS ID, Balance, Assigned or Enrolled Building, Grade (students only), and alert message if applicable.\nNotice the Current Balance and Transaction Total.\nSelect the payment item:Cash - click to select cash as the payment methodCheck - click to select check as the payment methodExternal Payment - click to select external payment as the payment method if enabledSchool Account - click to select school account as the payment method if enabled\nAmount - enter the amount paid (cash, check only)Check Number (not pictured, check only) - enter the check number for documentation\nKeyboard - use the on screen keyboard to type in lieu of a physical keyboard\nQuick Numbers - use the quick numbers to enter a common amount quickly\nChange - notice the change due if change will be given (Change = Amount - Transaction Total)\nBalance After Total - notice the balance after total if change will not be given (Balance After Total = Current Balance + Change)\nTotal - select the total option to complete the transaction and return to the PIN, Photo, or Buffered screen. Note: Total options vary by payment method.Total with Change - click to give excess funds as change (cash payments only)Total with Deposit - click to apply excess funds to accountTotal - click to complete an exact payment transaction\nÂ© 2024 | EMS LINQ, LLC\nwww.linq.com\nLINQ Nutrition (TITAN) Help, updated 10/2024\nNutrition (TITAN)"}